var option = {
    title: '折线图堆叠',
    legend: ['邮件营销', '联盟广告', '视频广告', '直接访问', '搜索引擎'],
    xAxis: ['周一', '周二', '周三', '周四', '周五', '周六', '周日'],
    yAxis: [0, 500, 1000, 1500, 2000, 2500, 3000],
    series: [{
            name: '邮件营销',
            type: 'line',
            color: 'rgb(194, 53, 49)',
            data: [400, 530, 101, 134, 1300, 500, 3000]
        },
        {
            name: '联盟广告',
            type: 'line',
            color: 'rgb(47, 69, 84)',
            data: [220, 1882, 191, 234, 2190, 330, 310]
        },
        {
            name: '视频广告',
            type: 'line',
            color: 'rgb(97, 160, 168)',
            data: [150, 232, 2201, 554, 1190, 330, 410]
        },
        {
            name: '直接访问',
            type: 'line',
            color: 'rgb(213, 133, 105)',
            data: [720, 332, 301, 2334, 390, 980, 320]
        },
        {
            name: '搜索引擎',
            type: 'line',
            color: '#91c7ae',
            data: [820, 932, 901, 934, 1290, 1330, 1320]
        }
    ]
};
